Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: but you never said anything about that dead girl.
es_419: Pero nunca me contaste sobre la chica muerta.

source: You guys are crazy.
es_419: Están locos de remate.

source: She was... right in front of me, right?
es_419: Estaba… justo delante de mí, ¿verdad?

source: GIGGLE
es_419: JIJIJI

source: But my dad used to teach her.
es_419: Pero papá le enseñaba.

source: miraculously, after seven years...
es_419: De milagro, después de siete años…

source: everyone but her.
es_419: Todos menos ella.

source: I thought I would cry when I saw grandma's gravestone...
es_419: Creí que lloraría al ver la tumba de la abuela…

source: because of time, I've changed.
es_419: Pero con el tiempo, cambié.

source: B-But...
es_419: P-pero…

source: that's grandma's chair...
es_419: Esa es la silla de la abuela…

source: wait, why?
es_419: ¿Qué? ¿Por qué?

source: umm, sorry...
es_419: Mmm, perdón…

source: How did I end up here?
es_419: ¿Cómo llegué hasta aquí?

source: But considering ara's scores, I don't think he'll let me.
es_419: Pero con las notas de Ara, no creo que me vaya a dejar.

source: ...Dad didn't come with you?
es_419: ¿papá no vino contigo?

source: actually, I'd travel to the past not only for him.
es_419: En realidad, no viajaría al pasado solo por él.

source: I couldn't sleep that night.
es_419: No pude dormir esa noche.

source: I miss my grandma the most.
es_419: a quien más extraño es a mi abuela.

source: you'll have to explain everything to ara and me!
es_419: ¡Nos vas a explicar todo a mí y a tu hermana!

source: You should've told me!
es_419: ¡Tendrías que habérmelo dicho!

source: Ezra and I tried to tell him what happened chronologically.
es_419: Ezra y yo tratamos de contarle lo que pasó cronológicamente.

source: I knew the answer since it's always the same thing.
es_419: Sé lo que vas a decir, siempre dices lo mismo.

source: feeling humiliated, she ran...
es_419: De la humillación, salió corriendo…

source: You're Kala Maharani, right?
es_419: Eres Kala Maharani, ¿verdad?

source: No, she's all right
es_419: Nada, está bien

source: yeah...
es_419: Sí…

source: How do you know my name?
es_419: ¿Cómo sabes mi nombre?

source: you've heard of utube, right? she's a beauty content creator now, with tons of subscribers too.
es_419: Conoces Utube, ¿no? Ahora crea contenido de belleza ahí, y tiene muchísimos suscriptores.

source: so fussy.
es_419: Qué molesta.

source: in 2013, they only had the head.
es_419: En 2013 solo habían hecho la cabeza.

source: To me, I had gone missing for a couple of seconds...
es_419: Para mí, solo desaparecí por un par de segundos.

source: I can't believe they're doing this to me.
es_419: No puedo creer que me estén haciendo esto.

source: kala! where are you?!
es_419: ¡Kala! ¿Dónde estás?

source: here.
es_419: Toma.

source: now it's worth a whopping 600 million rupiahs.*
es_419: Y ahora vale la enorme suma de 600 millones de rupias.*

source: BEEP
es_419: BIP

source: Why don't you look out the window?
es_419: ¿Por qué no miras por la ventana?

source: I see...
es_419: Ya veo…

source: dad, it's kala...
es_419: Papá, soy Kala…

source: ...with the exact same appearance...
es_419: Se veía exactamente igual…

source: Do you have to slap me?!
es_419: ¡¿Tenías que golpearme?!

source: So can you come?
es_419: Vas a venir?

source: So, you won't be angry with me?!
es_419: Entonces, ¿no te vas a enojar conmigo?

source: You'd be better off working with some physics formulas than going surfing.
es_419: Te conviene más resolver algunas fórmulas de física que ir a surfear.

source: But I'm trying to get a grasp on the situation.
es_419: Pero estoy tratando de entender la situación.

source: So Dad is coming too, right?
es_419: Entonces papá también viene, ¿no?

source: But how?
es_419: ¿Cómo?

source: everyone has forgotten ABOUT it and moved on...
es_419: Todos lo olvidaron y siguieron con sus vidas…

source: A QUARREL
es_419: UNA DISPUTA

source: it's because my dad always compared me to him.
es_419: Mi papá siempre me comparaba con él.

source: Who would pay for your food?
es_419: ¿Quién te va a pagar la comida?

source: (born in 1996)
es_419: (nací en 1996)

source: did dad allow you?
es_419: ¿Y papá te deja?

source: Y-Yes...
es_419: S-sí…

source: Early enough for us to hang out before the new year.
es_419: Tan temprano como para disfrutar del día antes de Año Nuevo.

source: Will Kala overcome the bizarre experience she’s facing?
es_419: ¿Podrá Kala superar esta experiencia tan extraña a la que se enfrenta?

source: I thought she would think I'm crazy...
es_419: Creí que pensaría que estaba loca…

source: BZZZT
es_419: BZZZZ

source: and the school counselor found out about it.
es_419: Y el consejero escolar se enteró.

source: and then, I had to meet with the whole family.
es_419: Y después tuve que ir a ver a toda la familia.

source: Mr. Agung was the detective who had been working on my case...
es_419: El Sr. Agung era el detective que había estado trabajando en mi caso.

source: We looked away for a second, and you went missing again.
es_419: Nos distraemos un segundo y te desapareces de nuevo.

source: Who would buy the ticket?
es_419: ¿Quién te va a comprar el boleto?

source: you're not going to give me money or anything, are you?
es_419: No me vas a dar dinero ni nada, ¿verdad?

source: Should I tell her to give the ticket to anyone?
es_419: ¿Le digo a Ingrid que le dé el boleto a alguien?

source: mr. agung!
es_419: era el señor Agung.

source: So it's not a dream.
es_419: Parece que no es un sueño.

source: you hid my lip stain inside gavin's bag.
es_419: Escondiste mi labial en el bolso de Gavin.

source: What a troublesome kid you are!
es_419: ¡Qué problemática eres!

source: He always comes here on Eid fitr* day and brings us something.
es_419: Siempre viene para la Fiesta del Fin del Ayuno* y trae cositas.

source: But after some thought, I managed to grasp the situation.
es_419: Pero después de pensarlo un poco, logré comprender la situación.

source: but where is EZRA KALA ?
es_419: ¿Pero dónde está Ezra Kala?

source: I thought my presence would make things got uglier, so I left first.
es_419: Pensé que si me quedaba, las cosas empeorarían. Así que me fui.

source: I can't swim!
es_419: ¡No sé nadar!

source: I'm so sorry, Lenca.
es_419: Perdóname, Lenca.

source: yeah, she's a beauty vlogger.
es_419: Sí, es una vlogger de belleza.

source: WOWWW
es_419: GUAU

source: ...And Ezra contacted him when I collapsed.
es_419: Y se contactó con él cuando me desmayé.

source: he's really busy there...
es_419: Está muy ocupado allí…

source: I'm not sure if you're real or not, but I know you almost drowned,
es_419: No sé si eres real o no, pero sí estoy seguro de que casi te ahogas.

source: is ezra in Bandung already?
es_419: ¿Ezra ya volvió de Bandung?

source: She's old enough to go there on her own.
es_419: Ya está grandecita como para ir sola.

source: umm, yes, sir...
es_419: Emm, sí, señor…

source: it keeps bothering me that I ran away from home.
es_419: Aún me preocupa haberme escapado de mi casa.

source: deja vu...
es_419: Déjà vu…

source: I don't wanna think too much about what might've changed...
es_419: No quiero pensar mucho en las cosas que cambiaron…

source: You have his number?
es_419: ¿Tienes su número?

source: We'll go this way, then we'll go that way.
es_419: Primero vamos por aquí, y luego vamos para allá.

source: that means...
es_419: Eso significa

source: a glass of brown sugar milk boba, please!
es_419: ¡Un té de burbujas con azúcar moreno, porfa!

source: You want to join them?
es_419: ¿Quieres ir con ellos?

source: You finished?
es_419: ¿Terminaste?

source: but now I'm hungry again.
es_419: pero tengo hambre otra vez.

source: it's from someone in my past who's no longer here.
es_419: Es de alguien de mi pasado que ya no está aquí.

source: Ezra, u promised to go out with me today!
es_419: Ezra, me prometiste que saldrías conmigo hoy!

source: I work at an IT company.
es_419: Trabajo en una empresa de tecnología.

source: Did you meet Lenca yesterday?
es_419: Te viste con Lenca ayer?

source: about what Dad did to me last time...
es_419: lo que papá me hizo la última vez.

source: What if I don't wanna sleep?
es_419: Y qué si no quiero ir a dormir?

source: The older you get, the harder it is to adapt.
es_419: Cuanto más viejo eres, más difícil es adaptarse.

source: we're doing this for you.
es_419: Lo hacemos por ti.

source: BYE, BALI!
es_419: ¡ADIÓS, BALI!

source: ...what's changed in the past seven years?
es_419: todo lo que cambió en estos últimos siete años.

source: O
es_419: U

source: first, I don't wanna be the third wheel.
es_419: Primero, no quiero andar metida en su relación.

source: they must be looking for me.
es_419: Seguro me están buscando.

source: ...You sure we're in 2021 now?
es_419: ¿Es cierto que estamos en 2021?

source: don't say that!
es_419: ¡No diga eso!

source: A Weeping Woman
es_419: El llanto de una mujer

source: ...is no longer with us, Kala.
es_419: ya no está con nosotros, Kala.

source: I know for sure how he would respond.
es_419: Sé muy bien cuál va a ser su respuesta.

source: I also want to enjoy my youth!
es_419: ¡Y quiero disfrutar de mi juventud!

source: see...
es_419: ¿Ves?…

source: S-So...
es_419: B-bueno…

source: Reach that hand and free yourself...
es_419: Dame la mano y sé libre…

source: however...
es_419: Pero…

source: The important thing is, we found you safe and sound.
es_419: Lo importante es que te encontramos sana y salva.

source: how confused would you be if you were in my shoes?
es_419: ¿Qué tan confundida estarías si estuvieras en mi lugar?

source: ...that our relationship has become toxic...
es_419: … nuestra relación se volvió tóxica…

source: ...But his facial expression suddenly changed.
es_419: … y su rostro cambió de repente.

source: PURR
es_419: PRRR

source: The Ezra I know could answer this!
es_419: ¡El Ezra que conozco sabría responder a esto!

source: Shush, lower your voice.
es_419: ¡Shh! Baja la voz.

source: b-but why?!
es_419: ¡¿P-por qué?!

source: sob...
es_419: Snif.

source: ...I want to know now.
es_419: … quiero saberlo ya.

source: promise me that you’ll always be around...
es_419: Prométeme que siempre estarás cerca

source: Kala, wake up.
es_419: Kala, despierta.

source: Today is December 31, 2020.
es_419: Hoy es 31 de diciembre del 2020.

source: don't worry, she's successful now anyway.
es_419: No pasa nada. Tiene mucho éxito a pesar de todo.

source: I was in the water, wasn't I?
es_419: Estaba en el agua, ¿verdad?

source: cars and propoerties will no longer be a luxury for us.
es_419: Los coches y las propiedades ya no serían un lujo para nosotras.

source: you sure?
es_419: ¿Segura?

source: Come again?!
es_419: ¡¿Qué dijiste?!

source: had I known I was going to disappear, I wouldn't have gone to Bali.
es_419: Si hubiera sabido que iba a desaparecer, no hubiera ido a Bali.

source: Do you...
es_419: ¿Tenías…

source: mom...
es_419: Mamá…

source: She's my girlfriend.
es_419: Es mi novia.

source: I think my mom would try to talk to your dad.
es_419: Creo que mi mamá podría intentar hablar con tu papá.

source: She'll wake up after a while.
es_419: En un rato se va a despertar.

source: But you know how my parents are (especially my dad).
es_419: pero ya sabes cómo son mis papás (sobre todo mi papá).

source: ...I'll need to ask my dad first if I can go.
es_419: … Primero le tengo que preguntar a mi papá.

source: THUD
es_419: PUM

source: You two really are sisters!
es_419: ¡No cabe duda de que son hermanas!

source: don't worry...
es_419: tranquila.

source: (The price in January 2021)
es_419: (El precio en enero de 2021)

source: When I was in high school, I made the mistake of choosing to study science.
es_419: Cuando estaba en la secundaria, cometí el error de elegir estudiar ciencias.

source: CRASH
es_419: PUM

source: yes, in two days...
es_419: Sí, en dos días…

source: ...I need to go to the restroom.
es_419: Tengo que ir al baño.

source: Let's go watch a movie!
es_419: ¡Vamos a ver una película!

source: bye, just text me once you're done.
es_419: Chau. Me envían un mensaje cuando terminen.

source: or maybe we just happened to have the similar ones.
es_419: O tal vez solo tenemos unos juegos muy parecidos.

source: Um, then...
es_419: Ah, entonces…

source: Kala didn't disappear again, I hope?
es_419: Kala no volvió a desaparecer, no?

source: in Australia, majoring in astronomy, but now I'm taking a semester off.
es_419: Estudio astronomía en Australia, pero me tomé este cuatrimestre para descansar.

source: HAA!
es_419: ¡AAH!

source: Grandma!
es_419: ¡Abuela!

source: W
es_419: F

source: time has made my hair gray.
es_419: Sí, me dejó el pelo blanco.

source: Just a friend?!
es_419: ¡¿Solo una amiga?!

source: I don't know either...
es_419: Yo tampoco lo sé.

source: I'm sorry,
es_419: Lo siento,

source: You knew all along...
es_419: Ya sabías…

source: THROB
es_419: FROTA

source: ...Ara said you're not going to be home until tomorrow!
es_419: … ¡Ara me dijo que no vendrías hasta mañana!

source: because if you're really a time traveler...
es_419: Si de verdad puedes viajar en el tiempo,

source: But, Mom...
es_419: Pero mamá…

source: I can't swim!!!
es_419: ¡¡¡No sé nadar!!!

source: so now, will you tell me about that girl?
es_419: ¿Ahora me vas a contar quién es esa chica?

source: TAP
es_419: TAC

source: on New Year's Eve!
es_419: en Año Nuevo!

source: what about you? did you think...
es_419: ¿Y tú? ¿Pensabas que…

source: is this the bracelet you mentioned?
es_419: ¿Es este el brazalete del que hablabas?

source: SPLAT
es_419: PLAF

source: wait, does that mean...
es_419: Un momento, entonces…

source: Where do you wanna take me to?
es_419: ¿A dónde quieres llevarme?

source: I was supposed to go to bandung together with lenca on the same day.
es_419: En realidad, tendría que haber vuelto con Lenca el mismo día.

source: CRACKLE
es_419: CRAC

source: When I was hugging Mom...
es_419: Mientras abrazaba a mamá,

source: things have changed, you know.
es_419: Las cosas cambiaron, ya sabes.

source: Don't lose your temper when dealing with your own children!
es_419: ¡No pierdas los estribos cuando trates con tus hijas!

source: My friend has the exact same bracelet as yours.
es_419: Mi amiga tiene un brazalete igual al tuyo.

source: Why does it have to die at a time like this?!
es_419: ¡¿Por qué me pasa esto en un momento así?!

source: what is it?
es_419: ¿Qué pasa?

source: I shouldn’t have said that.
es_419: No debí decir eso.

source: My phone died.
es_419: Mi teléfono se apagó.

source: SEE YOU!
es_419: ¡NOS VEMOS!

source: *about $41,600
es_419: *casi 42 mil USD

source: There was an vacant seat available, I bought it instantly.
es_419: Se desocupó un asiento, así que lo compré enseguida.

source: she must've hit puberty.
es_419: Ya es toda una adolescente.

source: Why wouldn’t you listen to me?!
es_419: ¿Por qué no me escuchas?

source: is it really her, gavin?
es_419: ¿De verdad es ella, Gavin?

source: if you really are a time traveler...
es_419: Si de verdad puedes viajar en el tiempo…

source: But how about Gavin?
es_419: ¿Y qué hay de Gavin?

source: what exactly did you do before you were zapped into the past?
es_419: ¿Qué hacías exactamente antes de viajar al pasado?

source: Umm... eating rice, I think?
es_419: Mmm… Comer arroz, creo.

source: ...a missing girl from seven years ago.
es_419: El de la chica que se perdió hace siete años.

source: ...She sounded as if she was about to cry...
es_419: Parece que estuviera al borde del llanto.

source: i couldn't find the number 7 candle at the shop.
es_419: La tienda no tenía velas con el número 7.

source: she dropped out of college.
es_419: Es que abandonó los estudios.

source: So we can take a walk while waiting for her.
es_419: Podemos dar un paseo mientras la esperamos.

source: You remind me of my mom...
es_419: Me recuerdas un poco a mi mamá.

source: CHAPTER 17:
es_419: CAPÍTULO 17:

source: I'm scared...
es_419: Tengo miedo…

source: We didn't tell her yet since you weren't there.
es_419: No le dijimos nada aún porque faltabas tú.

source: *see again, Chapter 5.
es_419: *Lee de nuevo el capítulo 5.

source: bandung international airport
es_419: Aeropuerto Internacional de Bandung

source: I hugged him so tightly since we didn't meet for such a long time.
es_419: Le di un fuerte abrazo porque hacía mucho que no nos veíamos.

source: she stays here unless ara comes along.
es_419: No irá a no ser que Ara la acompañe.

source: your dad...
es_419: Tu papá…

source: it depends on how angry he'll get.
es_419: Depende de qué tan furioso esté papá.

source: I said no!
es_419: ¡Dije que no!

source: *about $7
es_419: *casi 7 USD

source: she's my ghost.
es_419: Ella es mi fantasma.

source: You've been gone for seven years.
es_419: Llevamos siete años sin saber nada de ti.

source: You know, if an hour is 3,600 seconds,
es_419: Si una hora tiene 3600 segundos,

source: I did eat just before I collapsed,
es_419: Ya había comido antes de desmayarme,

source: Ezra's gonna join us too.
es_419: Ezra también viene.

source: I was also wrong.
es_419: Yo también me equivoqué.

source: GASP
es_419: UFF

source: yeah, you guys are the ones who changed.
es_419: Sí, fueron ustedes los que cambiaron.

source: DRIP
es_419: PLIC

source: When did you contact her?
es_419: ¿Cuándo la llamaste?

source: They must be looking for me.
es_419: Seguro me están buscando.

source: it's my pleasure, ma'am.
es_419: Fue un placer, señora.

source: I remember she was so adamant on majoring in pharmacy.
es_419: Me acuerdo que estaba muy emocionada por estudiar farmacia.

source: You came all the way here just to slap me across the face?!
es_419: ¡¿Hiciste todo el viaje hasta aquí solo para darme una bofetada?!

source: Oh, so you know his girlfriend?
es_419: Ah, conoces a su novia?

source: on my motorcyle.
es_419: En mi motocicleta.

source: Unfortunately, I had to close your case despite Ms. Maharani's insistence.
es_419: Por desgracia, tuve que cerrar tu caso pese a la insistencia de la Sra. Maharani.

source: yes, mom!
es_419: ¡Sí, mamá!

source: booo, party pooper!
es_419: ¡Buu! ¡Qué aguafiestas!

source: I'm not as smart as he is. besides, I believe you're smarter than me.
es_419: No soy tan inteligente como él, además creo que tú sabes más que yo.

source: People said I lost my mind,
es_419: La gente decía que había perdido la cabeza

source: and the police assumed she's unlikely to survive.
es_419: La policía pensó que era poco probable que estuviera viva.

source: in other words, I'm old.
es_419: Y ahora ya estoy vieja.

source: and this chair...
es_419: Y esta silla…

source: MAHARANi KALA'S MOM
es_419: MAHARANI MAMÁ DE KALA

source: I'm not a kid anymore.
es_419: Ya no soy una niña.

source: BTW.
es_419: Otra cosa.

source: I've watched your videos, ingrid.
es_419: Ya me vi tus videos, Ingrid.

source: I should’ve told you about what happened.
es_419: Tendría que haberte contado lo que pasó.

source: while she was drowning in the sea or--
es_419: cuando se estaba ahogando en el mar, o…

source: I didn't know that my grandma had passed away.
es_419: No sabía que mi abuela había fallecido.

source: Please tell me it's just a dream!
es_419: ¡Dime que todo esto es un sueño!

source: Actually, I kinda believe it.
es_419: En realidad, yo sí lo creo.

source: I could get pregnant!
es_419: ¡Podría quedar embarazada!

source: Shower?
es_419: ¿Ducha?

source: Sorry...
es_419: Perdón.

source: now look,
es_419: Veamos,

source: and see the younger version of yourself.
es_419: para ver una versión más joven.

source: I can't see clearly...
es_419: No veo bien…

source: He took Kala to Lembang.
es_419: Llevó a Kala a Lembang.

source: I'm Agung, with the police.
es_419: Me llamo Agung y soy de la policía.

source: the charade.
es_419: con la farsa.

source: get off of me, you stink!
es_419: ¡Suéltame! ¡Apestas!

source: (Kala the cat.)
es_419: (Kala, la gata.)

source: THE BOYFRIEND
es_419: EL NOVIO

source: Can you bring me some milk pies?
es_419: ¿Me puedes traer un poco de pastel?

source: how old are you?
es_419: ¿Cuántos años tienes?

source: I have to find ezra!
es_419: ¡Tengo que encontrar a Ezra!

source: She would chase him with a broom whenever he scolded her grandchildren.
es_419: Lo perseguía con una escoba cada vez que regañaba a sus nietas.

source: I contacted your mom and Mr. Agung.
es_419: La llamé a tu mamá y al Sr. Agung.

source: BLUSH
es_419: SONROJADA

source: you know, there was a bridge that was packed with love locks.
es_419: Aquí había un puente lleno de candados de amor.

source: You're not even eighteen.
es_419: Ni siquiera tienes dieciocho.

source: Eating rice, my foot!
es_419: ¡Arroz, mis polainas!

source: I'm the one who whisked you away.
es_419: ¡Fui yo el que te sacó de ahí!

source: No problem.
es_419: No pasa nada.

source: (IN SYNC.)
es_419: (AL MISMO TIEMPO)

source: Is she that important...?
es_419: Tan importante es ella?

source: ingrid's parents helped me with the ticket.
es_419: Los papás de Ingrid me ayudaron a comprar el boleto.

source: Your dad and I will be worried about you.
es_419: Tu papá y yo vamos a estar muy preocupados.

source: right, it's time to watch ingrid's videos to know about her more.
es_419: Bien, voy a ver los videos de Ingrid para saber más de ella.

source: bossing me around because you're older.
es_419: Me das órdenes solo porque eres mayor.

source: and how did you come back?
es_419: ¿Y cómo volviste?

source: ...you go back to the past...
es_419: … viajes al pasado…

source: Just put away your hand!
es_419: ¡Saca la mano!

source: it still hurts...
es_419: Y aún duele…

source: Uhh...
es_419: Eh…

source: Through the window.
es_419: Por la ventana.

source: ...and I hope I won't regret my decision...
es_419: y espero no arrepentirme de haber tomado esta decisión.

source: it's 321, 775, 530, 822.
es_419: Es 321 775 530 822.

source: Chill out, Kala.
es_419: Relájate, Kala.

source: And I'll use my own savings-!
es_419: ¡Y pienso usar mis ahorros!

source: I don't wanna reply to this message.
es_419: No quiero responder a este mensaje.

source: Oh, right.
es_419: Ah, bueno.

source: wait up, gavin.
es_419: Espera, Gavin.

source: you've been gone for how long? seven years!
es_419: ¿cuánto tiempo llevas desaparecida? ¡Siete años!

source: Wait, Ezra!
es_419: ¡Espera, Ezra!

source: I want to tell her,
es_419: Quiero contarle

source: because if you really are a time traveler...
es_419: Si de verdad puedes viajar en el tiempo…

source: Your grandma passed away in 2016,
es_419: Falleció en el 2016,

source: MEOW
es_419: MIAU

source: first blood!
es_419: ¡Primera sangre!

source: that's called bribery.
es_419: Eso sería un soborno.

source: ezra is here...
es_419: Ezra está aquí.

source: also, why would I examine her?
es_419: ¿Y por qué tengo que revisarla?

source: I'm so happy to know that gavin still remembers me.
es_419: Me pone tan feliz que Gavin aún se acuerde de mí.

source: Don't say that!
es_419: ¡No digas eso!

source: around 20 years ago, there was a huge fire here.
es_419: Hace 20 años, ocurrió un gran incendio aquí.

source: now I have to meet my friends...
es_419: Ahora me veo con unos amigos…

source: I'm shocked!
es_419: ¡Qué impresión!

source: so it's the moon's gravitational pull that generates the tidal force.
es_419: Es la atracción gravitatoria de la luna la que genera las mareas.

source: ...she's my ghost...
es_419: … ella es mi fantasma…

source: I can barely understand!
es_419: ¡Me cuesta entenderlo!

source: Actually, it's all my fault.
es_419: En realidad, es todo culpa mía.

source: it's me, Ezra!
es_419: ¡Soy yo! ¡Ezra!
